import React from 'react';
import { Container, Typography, Accordion, AccordionSummary, AccordionDetails, Box } from '@mui/material';
import Navbar from '../components/Navbar';
import ExpandMoreIcon from '@mui/icons-material/ExpandMore';
import Footer from "../components/Footer";

const FAQPage = () => {
    const faqData = [
        {
            question: 'Як отримати рекомендації по вибору спеціалізації на основі моїх оцінок в школі?',
            answer: 'Для отримання рекомендацій, перейдіть в розділ "Обрати напрямок" та заповніть необхідну інформацію про ваші академічні досягнення. Наша система автоматично надасть вам персоналізовані рекомендації на основі цих даних.',
        },
        {
            question: 'Як система враховує різні предмети при наданні рекомендацій?',
            answer: 'Наша система аналізує ваші оцінки з різних предметів та враховує їх при формуванні рекомендацій. Ми розглядаємо ваші сильні та слабкі сторони у кожному предметі, щоб надати вам найкращі поради для вибору спеціалізації.',
        },
        {
            question: 'Чи можна довіряти рекомендаціям вашої системи?',
            answer: 'Так, наша система використовує передові алгоритми аналізу та має великий обсяг даних для формування точних рекомендацій. Проте завжди розглядайте їх як поради, і враховуйте власні інтереси та цілі при виборі спеціалізації.',
        },
        {
            question: 'Як визначити свої інтереси та навички для вибору професії?',
            answer: 'Спробуйте провести аналіз своїх хобі, захоплень та досягнень. Розгляньте, що вам подобається робити в свій вільний час. Обговоріть свої інтереси з вчителями, батьками та друзями для отримання порад.',
        },
        {
            question: 'Як підготуватися до вступу в університет?',
            answer: 'Зберіть інформацію про вимоги до вступу обраних університетів та спеціальностей. Спробуйте отримати додаткові знання та навички в обраній галузі. Підготуйте документи та долучіть рекомендації.',
        },
        {
            question: 'Як вибрати професію, яка буде відповідати моїм цілям у майбутньому?',
            answer: "Визначте свої цілі та уявлення про майбутнє. Розгляньте можливі шляхи кар'єрного зростання в обраній професії. Порадьтеся з фахівцями та проведіть дослідження ринку праці.",
        },
    ];

    return (
        <Box>
            <Navbar />
            <Container
                sx={{
                    paddingTop: 4,
                    paddingBottom: 4,
                }}
            >
                <Typography variant="h4" gutterBottom>
                    Часто задавані питання абітурієнтів
                </Typography>

                {faqData.map((faq, index) => (
                    <Accordion key={index} sx={{ marginBottom: 2 }}>
                        <AccordionSummary expandIcon={<ExpandMoreIcon />}>
                            <Typography variant="h6" >{faq.question}</Typography>
                        </AccordionSummary>
                        <AccordionDetails>
                            <Typography>{faq.answer}</Typography>
                        </AccordionDetails>
                    </Accordion>
                ))}
            </Container>

        </Box>
    );
};

export default FAQPage;
